# Pandas

### 1 Introduction to Pandas

* What is Pandas?
* Why use Pandas?
* Installing Pandas

### 2 Core Pandas Data Structures

* Series
* DataFrame

### 3 Data Import and Export

* Reading data from various file formats (CSV, Excel, JSON, etc.)
* Writing data to various file formats

### 4 Data Exploration and Analysis
* Head, tail
* Indexing and slicing data
* Descriptive statistics
* Sorting data
* Filtering data
* Grouping and aggregating data

### 5 Data Manipulation
* Renaming columns and indexes
* Handling missing data
* Merging, joining, and concatenating DataFrames
* Reshaping and pivoting data
* Applying functions to data
* Column  operations
* row operations 

### 6 Assignment: Getting Started with Pandas

## Introduction to Pandas

### What is Pandas?
Pandas is an open-source Python library that provides easy-to-use and powerful data structures, as well as data analysis tools. The name "Pandas" is derived from the term "Panel Data," which is a term used in statistics and econometrics to describe multi-dimensional structured data sets. It was created by Wes McKinney in 2008 and has since become one of the most popular libraries for data manipulation and analysis in Python.


Pandas primarily offers two data structures: Series and DataFrame. A Series is a one-dimensional array-like object that can hold any data type, while a DataFrame is a two-dimensional tabular data structure with labeled axes (rows and columns). These data structures make it easy to manipulate, clean, and analyze data in Python.

### Why use Pandas?

Pandas is widely used because it offers several benefits for data analysis, including:

* Ease of use: Pandas provides an intuitive and user-friendly interface for working with data, making it accessible to both programmers and non-programmers alike.

    
    
* Flexibility: Pandas can handle data of various formats and types, including CSV, Excel, SQL, JSON, and more. It can work with data ranging from small to large datasets and can perform complex operations with minimal code.

    
    
* Efficiency: Pandas is built on top of NumPy, a powerful numerical computing library in Python, which allows for fast and efficient data manipulation and computation.

    
    
* Compatibility: Pandas integrates well with other Python libraries like Matplotlib and Seaborn for data visualization, and Scikit-learn for machine learning.

    
    
* Rich ecosystem: The Pandas library has a large and active community, which continuously contributes to its development, adding new features and improvements.

### Installing Pandas

NB : If you are working with Jupyter Notebook or Google Colab, Pandas  should already be installed.

To install Pandas, you can use the package manager pip (for Python 2) or pip3 (for Python 3). Open your terminal or command prompt and type the following command:

In [40]:
pip install pandas

Requirement already satisfied: pandas in c:\users\tekin_dealers\anaconda3\lib\site-packages (2.0.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\tekin_dealers\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\tekin_dealers\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\tekin_dealers\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\tekin_dealers\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\tekin_dealers\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

For those using Anaconda distribution, you can install Pandas using the conda package manager:

In [ ]:
conda install pandas

Once the installation is complete, you can verify the installation by importing Pandas in your Python script or Jupyter Notebook:

In [ ]:
import pandas as pd

The pd alias is a convention used by the Pandas community to simplify the usage of Pandas functions and methods.

## Core Pandas Data Structures

Pandas provides two primary data structures: Series and DataFrame. These data structures are designed to handle a wide variety of data types and formats, making it easy to work with and manipulate data in Python.

### Series

A Series is a one-dimensional, labeled array capable of holding any data type (integers, strings, floats, Python objects, etc.). It has an index that labels each element in the vector. You can think of a Series as similar to a Python list with labels for each element.

#### Creating a Series

You can create a Series by passing a list of values and, optionally, an index. If you don't provide an index, Pandas will create a default integer index ranging from 0 to the length of the data minus one.

In [41]:
import pandas as pd

# Creating a Series with default index
data = [4, 7, -5, 3]
s1 = pd.Series(data)
print(s1)

print('\n')
print('\n')

# Creating a Series with a custom index
index = ['a', 'b', 'c', 'd']
s2 = pd.Series(data, index=index)
print(s2)

0    4
1    7
2   -5
3    3
dtype: int64




a    4
b    7
c   -5
d    3
dtype: int64

### DataFrame
A DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). You can think of a DataFrame as a table in a spreadsheet, where data is organized in rows and columns.

#### Creating a DataFrame
There are multiple ways to create a DataFrame. Some common ways include:

* From a Series
* Reading data from external sources (CSV, Excel, JSON, etc.)

 From a Series

In [43]:
import pandas as pd

s1 = pd.Series([25, 30, 35, 40], name='age')

s2 = pd.Series(['New York', 'San Francisco', 'Los Angeles', 'Chicago'], name='city')

df = pd.concat([s1, s2], axis=1)
df

   age           city
0   25       New York
1   30  San Francisco
2   35    Los Angeles
3   40        Chicago

In [44]:
data = pd.DataFrame({"age" : [25, 30, 35, 40],
                    "city" :['New York', 'San Francisco', 'Los Angeles', 'Chicago'] })

In [45]:
data

   age           city
0   25       New York
1   30  San Francisco
2   35    Los Angeles
3   40        Chicago

Reading data from external sources

To read data from external sources, like a CSV file, you can use the pd.read_csv() function.

In [ ]:
import pandas as pd

file_path = 'data/listings.csv'

df = pd.read_csv(file_path)

 You can also read data from other formats like Excel, JSON, SQL, etc. by using appropriate Pandas functions such as 

pd.read_excel(),

pd.read_json(), 
 
or pd.read_sql().

# Data Import and Export

Pandas provides several functions to read and write data from and to various file formats, making it easy to work with different data sources and formats.

### Reading Data from Various File Formats

#### 1. CSV
To read data from a CSV (Comma Separated Values) file, you can use the pd.read_csv() function.

In [46]:
import pandas as pd

file_path = 'listings.csv'

df = pd.read_csv(file_path)

In [47]:
df

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2818,Quiet Garden View Room & Super Fast Wi-Fi,3159,Daniel,NaN,Oostelijk Havengebied - Indische Buurt,52.364350,4.943580,Private room,69,3,322,2023-02-28,1.90,1,44,37,0363 5F3A 5684 6750 D14D
1,20168,Studio with private bathroom in the centre 1,59484,Alexander,NaN,Centrum-Oost,52.364070,4.893930,Private room,106,1,339,2020-04-09,2.14,2,0,0,0363 CBB3 2C10 0C2A 1E29
2,27886,"Romantic, stylish B&B houseboat in canal district",97647,Flip,NaN,Centrum-West,52.387610,4.891880,Private room,143,3,248,2023-02-26,1.82,1,14,20,0363 974D 4986 7411 88D8
3,28871,Comfortable double room,124245,Edwin,NaN,Centrum-West,52.367750,4.890920,Private room,76,2,476,2023-02-28,3.12,2,79,97,0363 607B EA74 0BD8 2F6F
4,29051,Comfortable single room,124245,Edwin,NaN,Centrum-Oost,52.365840,4.891110,Private room,56,2,618,2023-03-03,4.23,2,69,85,0363 607B EA74 0BD8 2F6F
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6993,842462220391708128,Flat in the center of Amsterdam,47205615,Edgar,NaN,Centrum-Oost,52.359386,4.893717,Entire home/apt,450,1,0,NaN,NaN,1,70,0,0363 80A2 E913 8FAD A98A
6994,842493348876281257,3bed ark close to city centre,454835217,Barbara,NaN,Oud-Noord,52.401950,4.902256,Entire home/apt,360,2,0,NaN,NaN,1,357,0,0363 B755 6BD8 6F8D AA7F
6995,842634905680862660,ground floor studio 46m2 at boulevard & canal,504448710,Ivanka,NaN,Oud-Noord,52.393502,4.899826,Entire home/apt,92,3,0,NaN,NaN,1,67,0,0363 76A0 B46B 281A C38E
6996,842713539293550316,Oasis in trendy Amsterdam East,17537276,Thomas,NaN,Watergraafsmeer,52.351350,4.920430,Entire home/apt,250,1,0,NaN,NaN,1,315,0,0363 97C2 71FF 5383 DC95
6997,842754604161195632,Penthouse Loft with a View,20336096,Sean,NaN,Oud-Noord,52.388888,4.922216,Entire home/apt,333,2,0,NaN,NaN,1,5,0,0363 A514 512A A671 03A3

In [48]:
import pandas as pd

file_path = '../data/listings.csv'

df = pd.read_csv(file_path)
df

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,2818,Quiet Garden View Room & Super Fast Wi-Fi,3159,Daniel,NaN,Oostelijk Havengebied - Indische Buurt,52.364350,4.943580,Private room,69,3,322,2023-02-28,1.90,1,44,37,0363 5F3A 5684 6750 D14D
1,20168,Studio with private bathroom in the centre 1,59484,Alexander,NaN,Centrum-Oost,52.364070,4.893930,Private room,106,1,339,2020-04-09,2.14,2,0,0,0363 CBB3 2C10 0C2A 1E29
2,27886,"Romantic, stylish B&B houseboat in canal district",97647,Flip,NaN,Centrum-West,52.387610,4.891880,Private room,143,3,248,2023-02-26,1.82,1,14,20,0363 974D 4986 7411 88D8
3,28871,Comfortable double room,124245,Edwin,NaN,Centrum-West,52.367750,4.890920,Private room,76,2,476,2023-02-28,3.12,2,79,97,0363 607B EA74 0BD8 2F6F
4,29051,Comfortable single room,124245,Edwin,NaN,Centrum-Oost,52.365840,4.891110,Private room,56,2,618,2023-03-03,4.23,2,69,85,0363 607B EA74 0BD8 2F6F
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6993,842462220391708128,Flat in the center of Amsterdam,47205615,Edgar,NaN,Centrum-Oost,52.359386,4.893717,Entire home/apt,450,1,0,NaN,NaN,1,70,0,0363 80A2 E913 8FAD A98A
6994,842493348876281257,3bed ark close to city centre,454835217,Barbara,NaN,Oud-Noord,52.401950,4.902256,Entire home/apt,360,2,0,NaN,NaN,1,357,0,0363 B755 6BD8 6F8D AA7F
6995,842634905680862660,ground floor studio 46m2 at boulevard & canal,504448710,Ivanka,NaN,Oud-Noord,52.393502,4.899826,Entire home/apt,92,3,0,NaN,NaN,1,67,0,0363 76A0 B46B 281A C38E
6996,842713539293550316,Oasis in trendy Amsterdam East,17537276,Thomas,NaN,Watergraafsmeer,52.351350,4.920430,Entire home/apt,250,1,0,NaN,NaN,1,315,0,0363 97C2 71FF 5383 DC95
6997,842754604161195632,Penthouse Loft with a View,20336096,Sean,NaN,Oud-Noord,52.388888,4.922216,Entire home/apt,333,2,0,NaN,NaN,1,5,0,0363 A514 512A A671 03A3

#### 2. Excel
To read data from an Excel file, you can use the pd.read_excel() function. You may need to install the openpyxl package to read Excel files.

In [50]:
import pandas as pd

file_path = '../data/data.xlsx'

df = pd.read_excel(file_path, sheet_name='data')
df

   Latitude  Longitude    Category
0   40.7128   -74.0060  Category 1
1   34.0522  -118.2437  Category 2
2   41.8781   -87.6298  Category 3
3   37.7749  -122.4194  Category 1
4   47.6062  -122.3321  Category 2

#### 3. JSON
To read data from a JSON (JavaScript Object Notation) file, you can use the pd.read_json() function.

In [51]:
import pandas as pd

file_path = '../data/json.json'

df = pd.read_json(file_path)

In [52]:
df

                                                        InsuranceCompanies
Time                                                              Dec 2022
Top Insurance Companies  [{'No': '1', 'Name': 'Berkshire Hathaway', 'Ma...

#### 4. SQL
To read data from an SQL database, you can use the pd.read_sql() or pd.read_sql_query() functions. 

First, you need to establish a connection to the database using an appropriate Python library such as sqlite3 for SQLite databases or pymysql for MySQL databases.

In [ ]:
import pandas as pd
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('example.db')

# Read data from the database using an SQL query
query = "SELECT * FROM employees"
df = pd.read_sql_query(query, conn)
print(df)

# Close the connection
conn.close()

### Writing Data to Various File Formats


#### 1. CSV
To write data to a CSV file, you can use the to_csv() method of the DataFrame.

In [53]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

file_path = 'customers.csv'

df.to_csv(file_path, index=False)

### 2. Excel
To write data to an Excel file, you can use the to_excel() method of the DataFrame. You may need to install the openpyxl package to write Excel files.

In [54]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

file_path = 'output_data.xlsx'
df.to_excel(file_path, index=False, sheet_name='Sheet1')

#### 3. JSON
To write data to a JSON file, you can use the to_json() method of the DataFrame.

In [20]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

file_path = 'output_data.json'
df.to_json(file_path, orient='records')

#### 4. SQL
To write data to an SQL database , you can use the to_sql() method of the DataFrame. 

First, you need to establish a connection to the database using an appropriate Python library such as sqlite3 for

SQLite databases or 

pymysql for MySQL databases.

In [ ]:
import pandas as pd
import sqlite3

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Connect to the SQLite database
conn = sqlite3.connect('example.db')

# Write data to the database
table_name = 'employees'
df.to_sql(table_name, conn, if_exists='replace', index=False)

# Close the connection
conn.close()

Here's an example with MySQL database using the pymysql library:

In [ ]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Set up the database connection parameters
user = 'username'
password = 'password'
host = 'localhost'
database = 'my_database'

# Connect to the MySQL database
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}/{database}")

# Write data to the database
table_name = 'employees'
df.to_sql(table_name, engine, if_exists='replace', index=False)

# Close the connection
engine.dispose()

# Data Exploration and Analysis

Pandas provides numerous functions and methods to explore and analyze data, which are essential for understanding the dataset and making informed decisions.

### Head and Tail
Pandas provides head() and tail() methods for quickly previewing the first and last rows of a DataFrame, respectively.

In [57]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'age': [25, 30, 35, 40, 45, 50],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami', 'Boston']
}
df = pd.DataFrame(data)

# Display the first 3 rows
#df.head(3)

# Display the last 2 rows
df.tail(2)

    name  age    city
4    Eva   45   Miami
5  Frank   50  Boston

In [59]:
df.sample()

    name  age      city
0  Alice   25  New York

### Indexing and Slicing Data

Pandas provides several methods to index and slice data in a DataFrame, such as .loc[], .iloc[], and .at[].

#### 1. Using .loc[ ]
The .loc[] method allows you to index and slice data by label. You can select rows, columns, or both, using row and column labels.

In [63]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])
print(df)

print('\n')
print('\n')

# Select a single row by index label
print(df.loc['A'])

print('\n')
print('\n')

# Select multiple rows by index labels
print(df.loc[['A', 'C']])

print('\n')
print('\n')

# Select a single value using row and column labels
print(df.loc['A', 'city'])


print('\n')
print('\n')

# Slice rows and select specific columns
print(df.loc['A':'C', ['name', 'age']])

      name  age           city
A    Alice   25       New York
B      Bob   30  San Francisco
C  Charlie   35    Los Angeles
D    David   40        Chicago




name       Alice
age           25
city    New York
Name: A, dtype: object




      name  age         city
A    Alice   25     New York
C  Charlie   35  Los Angeles




New York




      name  age
A    Alice   25
C  Charlie   35

#### 2. Using .iloc[]
The .iloc[] method allows you to index and slice data by integer position. You can select rows, columns, or both, using row and column indices.

In [64]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)


print('\n')
print('\n')

# Select a single row by index position
print(df.iloc[0])


print('\n')
print('\n')

# Select multiple rows by index positions
print(df.iloc[[0, 2]])


print('\n')
print('\n')

# Select a single value using row and column positions
print(df.iloc[0, 2])


print('\n')
print('\n')

# Slice rows and select specific columns
print(df.iloc[0:3, 0:2])

      name  age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago




name       Alice
age           25
city    New York
Name: 0, dtype: object




      name  age         city
0    Alice   25     New York
2  Charlie   35  Los Angeles




New York




      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

#### 3. Using .at[]
The .at[] method allows you to access a single value in a DataFrame by row and column labels.

In [65]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D'])

# Access a single value using row and column labels
print(df.at['A', 'city'])

New York

### Descriptive Statistics
Pandas provides several methods to compute descriptive statistics of a DataFrame, such as describe(), mean(), median(), min(), max(), std(), sum(), and count().

In [66]:
import pandas as pd

data = {
    'age': [25, 30, 35, 40],
    'income': [50000, 55000, 60000, 65000]
}
df = pd.DataFrame(data)
print(df)

print('\n')
print('\n')

# Generate summary statistics
print(df.describe())

print('\n')
print('\n')


# Compute the mean
print(df.mean())

print('\n')
print('\n')


# Compute the median
print(df.median())

print('\n')
print('\n')


# Find the minimum and maximum values
print(df.min())
print(df.max())

print('\n')
print('\n')


# Compute the standard deviation
print(df.std())

print('\n')
print('\n')


# Calculate the sum and count
print(df.sum())
print(df.count())

   age  income
0   25   50000
1   30   55000
2   35   60000
3   40   65000




             age        income
count   4.000000      4.000000
mean   32.500000  57500.000000
std     6.454972   6454.972244
min    25.000000  50000.000000
25%    28.750000  53750.000000
50%    32.500000  57500.000000
75%    36.250000  61250.000000
max    40.000000  65000.000000




age          32.5
income    57500.0
dtype: float64




age          32.5
income    57500.0
dtype: float64




age          25
income    50000
dtype: int64
age          40
income    65000
dtype: int64




age          6.454972
income    6454.972244
dtype: float64




age          130
income    230000
dtype: int64
age       4
income    4
dtype: int64

### Sorting Data

To sort a DataFrame by the values in one or more columns, you can use the sort_values() method.

In [101]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Sort the DataFrame by the 'city' column in ascending order
sorted_df = df.sort_values('city')
print(sorted_df)

print('\n')
print('\n')


#ort the DataFrame by the 'city' column in descending order
sorted_df = df.sort_values('city', ascending=False)
print(sorted_df)

      name  age           city
3    David   40        Chicago
2  Charlie   35    Los Angeles
0    Alice   25       New York
1      Bob   30  San Francisco




      name  age           city
0      Bob   30  San Francisco
1    Alice   25       New York
2  Charlie   35    Los Angeles
3    David   40        Chicago

### Filtering Data
You can filter data in a DataFrame by applying conditions to one or more columns. The result will be a new DataFrame with only the rows that meet the specified conditions

In [72]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 35, 30, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

In [75]:
import pandas as pd

data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 40],
    'city': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Filter rows where the 'age' is greater than 30
filtered_df = df[df['age'] > 30]
print(filtered_df)

print('\n')
print('\n')


# Filter rows where the 'city' is 'New York' or 'Los Angeles'
filtered_df = df[df['city'].isin(['New York', 'Los Angeles'])]
print(filtered_df)

      name  age         city
2  Charlie   35  Los Angeles
3    David   40      Chicago




      name  age         city
0    Alice   25     New York
2  Charlie   35  Los Angeles

### Grouping and Aggregating Data
To group and aggregate data in a DataFrame, you can use the groupby() method followed by an aggregation function such as sum(), mean(), count(), or max().

In [76]:

data = {
    'department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'salary': [50000, 55000, 60000, 62000, 70000, 72000]
}
df = pd.DataFrame(data)
df

  department employee  salary
0         HR    Alice   50000
1         HR      Bob   55000
2         IT  Charlie   60000
3         IT    David   62000
4      Sales      Eva   70000
5      Sales    Frank   72000

In [78]:
import pandas as pd

data = {
    'department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'salary': [50000, 55000, 60000, 62000, 70000, 72000]
}
df = pd.DataFrame(data)

# Group by the 'department' column and compute the total salary
grouped_df = df.groupby('department')['salary'].max()
print(grouped_df)

print('\n')
print('\n')


# Group by the 'department' column and compute the average salary
grouped_df = df.groupby('department')['salary'].mean()
print(grouped_df)

print('\n')
print('\n')


# Group by the 'department' column and count the number of employees
grouped_df = df.groupby('department')['employee'].count()
print(grouped_df)

department
HR       55000
IT       62000
Sales    72000
Name: salary, dtype: int64




department
HR       52500.0
IT       61000.0
Sales    71000.0
Name: salary, dtype: float64




department
HR       2
IT       2
Sales    2
Name: employee, dtype: int64

## Data Manipulation

Pandas provides numerous functions and methods for manipulating data in a DataFrame. These tools help in cleaning, reorganizing, and transforming the dataset to facilitate analysis and visualization.

### Renaming Columns and Indexes

You can rename columns and indexes in a DataFrame using the rename() method.

In [79]:
import pandas as pd

data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data, index=['X', 'Y', 'Z'])

# Rename columns
df = df.rename(columns={'A': 'Col_A', 'B': 'Col_B', 'C': 'Col_C'})
print(df)

print('\n')
print('\n')


# Rename indexes
df = df.rename(index={'X': 'Row_X', 'Y': 'Row_Y', 'Z': 'Row_Z'})
print(df)

   Col_A  Col_B  Col_C
X      1      4      7
Y      2      5      8
Z      3      6      9




       Col_A  Col_B  Col_C
Row_X      1      4      7
Row_Y      2      5      8
Row_Z      3      6      9

### Handling Missing Data

Pandas provides several methods for handling missing data in a DataFrame, such as dropna(), fillna(), and interpolate().

In [85]:
import pandas as pd
import numpy as np

data = {
    'A': [1, np.nan, 3],
    'B': [4, 5, np.nan],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)
print(df)

print('\n')
print('\n')


# Drop rows with missing values
df_no_na = df.dropna()
print(df_no_na)

print('\n')
print('\n')


# # Fill missing values with a specified value
df_filled = df.fillna(0)
print(df_filled)

     A    B  C
0  1.0  4.0  7
1  NaN  5.0  8
2  3.0  NaN  9




     A    B  C
0  1.0  4.0  7




     A    B  C
0  1.0  4.0  7
1  9.0  5.0  8
2  3.0  9.0  9

### Merging, Joining, and Concatenating DataFrames

Pandas provides several methods to combine DataFrames, such as concat(), merge(), and join().

#### Concatenating DataFrames
To concatenate DataFrames, you can use the pd.concat() function. This function stacks DataFrames on top of each other (vertically) or side by side (horizontally).

In [88]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [86]:
import pandas as pd

data1 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
data2 = {
    'A': [7, 8, 9],
    'B': [10, 11, 12]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# Concatenate DataFrames vertically (default)
df_vertical = pd.concat([df1, df2], ignore_index=True)
print(df_vertical)

print('\n')
print('\n')


# Concatenate DataFrames horizontally
df_horizontal = pd.concat([df1, df2], axis=1)
print(df_horizontal)

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12




   A  B  A   B
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [37]:
data1 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
data2 = {
    'A': [7, 8, 9],
    'B': [10, 11, 12]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

#### Merging DataFrames
To merge DataFrames based on a common column, you can use the pd.merge() function

In [90]:
print(df1)

print('\n')
print('\n')

print(df2)

  key  value
0   A      1
1   B      2
2   C      3




  key  value
0   B      4
1   C      5
2   D      6

In [89]:
import pandas as pd

data1 = {
    'key': ['A', 'B', 'C'],
    'value': [1, 2, 3]
}
data2 = {
    'key': ['B', 'C', 'D'],
    'value': [4, 5, 6]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# Merge DataFrames on the 'key' column (inner join)
df_merged = pd.merge(df1, df2, on='key', suffixes=('_left', '_right'))
print(df_merged)

  key  value_left  value_right
0   B           2            4
1   C           3            5

In [ ]:
data1 = {
    'key': ['A', 'B', 'C'],
    'value': [1, 2, 3]
}
data2 = {
    'key': ['B', 'C', 'D'],
    'value': [4, 5, 6]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1

#### Joining DataFrames
To join DataFrames based on index, you can use the join()

In [93]:
print(df1)

print('\n')

print(df2)

   A  B
X  1  4
Y  2  5
Z  3  6


   C   D
Y  7  10
Z  8  11
W  9  12

In [91]:
import pandas as pd

data1 = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
data2 = {
    'C': [7, 8, 9],
    'D': [10, 11, 12]
}

df1 = pd.DataFrame(data1, index=['X', 'Y', 'Z'])
df2 = pd.DataFrame(data2, index=['Y', 'Z', 'W'])

# Join DataFrames using index (left join)
df_joined = df1.join(df2, how='right')
print(df_joined)

     A    B  C   D
Y  2.0  5.0  7  10
Z  3.0  6.0  8  11
W  NaN  NaN  9  12

### Reshaping and Pivoting Data

To reshape and pivot data in a DataFrame, you can use the pivot() and melt() functions.

#### Pivoting Data


The pivot() function is used to reshape a DataFrame from a "long" format to a "wide" format, where each unique value in a column becomes a new column in the output DataFrame. This function takes three main arguments: index, columns, and values. The index argument specifies the column(s) to use as the index for the output DataFrame, the columns argument specifies the column(s) to use as the new columns in the output DataFrame, and the values argument specifies the column(s) to use as the values in the output DataFrame.

In [96]:
df

         date         city  temperature  humidity
0  2021-01-01     New York           32        80
1  2021-01-01  Los Angeles           75        10
2  2021-01-02     New York           30        85
3  2021-01-02  Los Angeles           77         5

In [94]:
import pandas as pd

data = {
    'date': ['2021-01-01', '2021-01-01', '2021-01-02', '2021-01-02'],
    'city': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
    'temperature': [32, 75, 30, 77],
    'humidity': [80, 10, 85, 5]
}
df = pd.DataFrame(data)
df
# Pivot the DataFrame
df_pivoted = df.pivot(index='date', columns='city')
print(df_pivoted)

           temperature             humidity
city       Los Angeles New York Los Angeles New York
date
2021-01-01          75       32          10       80
2021-01-02          77       30           5       85

#### Melting Data

The melt() function, on the other hand, is used to reshape a DataFrame from a "wide" format to a "long" format, where multiple columns are "melted" into a single column. This function takes several arguments, including id_vars, value_vars, var_name, and value_name. The id_vars argument specifies the column(s) to use as identifier variables, the value_vars argument specifies the column(s) to use as the values to be melted, the var_name argument specifies the name for the new column that will contain the melted column headers, and the value_name argument specifies the name for the new column that will contain the melted values.

In [98]:
df

,date,New York_temperature,New York_humidity,Los Angeles_temperature,Los Angeles_humidity
0,2021-01-01,32,80,75,10
1,2021-01-02,30,85,77,5

In [97]:
import pandas as pd

data = {
    'date': ['2021-01-01', '2021-01-02'],
    'New York_temperature': [32, 30],
    'New York_humidity': [80, 85],
    'Los Angeles_temperature': [75, 77],
    'Los Angeles_humidity': [10, 5]
}
df = pd.DataFrame(data)
df
# Melt the DataFrame
df_melted = pd.melt(df, id_vars='date', var_name='city_and_measure', value_name='value')
df_melted

         date         city_and_measure  value
0  2021-01-01     New York_temperature     32
1  2021-01-02     New York_temperature     30
2  2021-01-01        New York_humidity     80
3  2021-01-02        New York_humidity     85
4  2021-01-01  Los Angeles_temperature     75
5  2021-01-02  Los Angeles_temperature     77
6  2021-01-01     Los Angeles_humidity     10
7  2021-01-02     Los Angeles_humidity      5

### Applying Functions to Data

You can apply functions to the data in a DataFrame using the apply() and applymap() methods.

In [39]:
import pandas as pd

data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)


# Apply a function to each column
def column_sum(col):
    return col.sum()

df_sum = df.apply(column_sum)
print(df_sum)

# Apply a function to each element
def double(x):
    return x * 2

df_doubled = df.applymap(double)
print(df_doubled)

A     6
B    15
C    24
dtype: int64
   A   B   C
0  2   8  14
1  4  10  16
2  6  12  18

### Column  Operations
You can perform various operations on columns and indexes in a DataFrame, such as adding, deleting, and reordering columns or changing the index.

In [99]:
import pandas as pd

data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data)

# Add a new column
df['D'] = [10, 11, 12]
print(df)

# Delete a column
df = df.drop('D', axis=1)
print(df)

# Reorder columns
df = df[['C', 'A', 'B']]
print(df)

# Update a column
df['A'] = [10, 20, 30]
print(df)

# Reset index
df_reset = df.reset_index(drop=True)

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12
   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
   C  A  B
0  7  1  4
1  8  2  5
2  9  3  6
   C   A  B
0  7  10  4
1  8  20  5
2  9  30  6

###  Row  Operations
To add a new row to a DataFrame, you can use the append() method with a dictionary of values or another DataFrame.

In [ ]:
data = {
    'A': [1, 2],
    'B': [3, 4]
}
df = pd.DataFrame(data)
new_row = {'A': 5, 'B': 6}
df = df.append(new_row, ignore_index=True)
df

In [ ]:
new_row_df = pd.DataFrame({'A': [7], 'B': [8]})
new_row_df

In [ ]:
import pandas as pd

data = {
    'A': [1, 2],
    'B': [3, 4]
}
df = pd.DataFrame(data)

# Add a new row using a dictionary
new_row = {'A': 5, 'B': 6}
df = df.append(new_row, ignore_index=True)
print(df)

# Add a new row using another DataFrame
new_row_df = pd.DataFrame({'A': [7], 'B': [8]})
df = df.append(new_row_df, ignore_index=True)
print(df)


# Update a row using .loc[]
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6]
}
df = pd.DataFrame(data)

df.loc[1] = [20, 50]
print(df)



# Delete a row
df = df.drop(1, axis=0)
print(df)

# Assignment: Getting Started with Pandas

In this assignment, you will practice using the Pandas library by performing some basic operations on a given dataset. You will explore the dataset, clean and manipulate the data, and answer some questions based on the data.

### Dataset 

The dataset you will be working with is a collection of information about various video games and their sales. which can be found here. https://www.kaggle.com/datasets/gregorut/videogamesales

### Instructions
* 1 Import the necessary libraries and load the dataset.
* 2 Display the first 10 rows of the dataset.
* 3 Display the shape and basic information about the dataset.
* 4 Check for missing data and handle it appropriately.
* 5 Display the top 5 video games by global sale
* 6 Calculate the total sales in North America for the 'Action' genre.
* 7 Find the top 3 publishers by global sales.
* 8 Calculate the average sales in Europe for the 'Shooter' genre.
* 9 Find the game with the highest sales in Japan in the 'Sports' genre.

# Solutions

In [1]:
# 1 Import the necessary libraries and load the dataset.
import pandas as pd

url = "../data/vgsales.csv"
df = pd.read_csv(url)

# 2 Display the first 10 rows of the dataset.

df.head(10)

# 3 Display the shape and basic information about the dataset.
print(df.shape)
print(df.info())

# 4 Check for missing data and handle it appropriately.
print(df.isna().sum())
df = df.dropna()

# 5 Display the top 5 video games by global sale

df_top5_global = df.nlargest(5, 'Global_Sales')
print(df_top5_global)

# 6 Calculate the total sales in North America for the 'Action' genre.
action_sales_na = df[df['Genre'] == 'Action']['NA_Sales'].sum()
print(action_sales_na)

# 7 Find the top 3 publishers by global sales.
top3_publishers = df.groupby('Publisher')['Global_Sales'].sum().nlargest(3)
print(top3_publishers)


# 8 Calculate the average sales in Europe for the 'Shooter' genre.
shooter_avg_sales_eu = df[df['Genre'] == 'Shooter']['EU_Sales'].mean()
print(shooter_avg_sales_eu)


# 9 Find the game with the highest sales in Japan in the 'Sports' genre.
highest_jp_sports = df[df['Genre'] == 'Sports'].nlargest(1, 'JP_Sales')
print(highest_jp_sports)

(16598, 11)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB
None
Rank              0
Name              0
Platform          0
Year            271
Genre             0
Publisher        58
NA_Sales          0
EU_Sales          0
JP_Sales          0
Other_Sales       0
Global_Sales      0
dtype: int64
   Rank                      Name Platform    Year         Genre Publisher  \
0     1                Wii Sports      Wii  2006.0        Sports  Nintendo
1     2         Super Mario Bros.      NES  1985.0      Platform  Nintendo
2     3            Mario Kart Wii      Wii  2008.0        Racing  Nintendo
3     4         Wii Sports Resort      Wii  2009.0        Sports  Nintendo
4     5  Pokemon Red/Pokemon Blue       GB  1996.0  Role-Playing  Nintendo

   NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0     41.49     29.02      3.77         8.46         82.74
1     29.08      3.58      6.81         0.77         40.24
2     15.85     12.88      3.79         3.31         35.82
3     15.75     11.01      3.28         2.96         33.00
4     11.27      8.89     10.22         1.00         31.37
861.7700000000001
Publisher
Nintendo           1784.43
Electronic Arts    1093.39
Activision          721.41
Name: Global_Sales, dtype: float64
0.24216068642745708
   Rank        Name Platform    Year   Genre Publisher  NA_Sales  EU_Sales  \
0     1  Wii Sports      Wii  2006.0  Sports  Nintendo     41.49     29.02

   JP_Sales  Other_Sales  Global_Sales
0      3.77         8.46         82.74